# Learning Pandas

In [2]:
import pandas as pd
dict1 = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}
dataFrame = pd.DataFrame(dict1)
dataFrame.head()

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [3]:
dataFrame['birthday']=[12, 45, 32, 45]
dataFrame

    Name  Age  birthday
0    Tom   20        12
1   nick   21        45
2  krish   19        32
3   jack   18        45

# adding a table to another

In [4]:
import pandas as pd
dict2 = {'Name':['Tomas', 'Abeer', 'jssika'], 'Age':[22, 19, 18]}
dict_n = pd.DataFrame(dict2)
dict_n

     Name  Age
0   Tomas   22
1   Abeer   19
2  jssika   18

# Getting table informations

In [5]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Age       4 non-null      int64
 2   birthday  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

# Getting datatype of each column

In [6]:
type(dataFrame['Name'].values[-1])

str

In [7]:
type(dataFrame['Age'].values[-1])

numpy.int64

In [8]:
dataFrame.dropna()

    Name  Age  birthday
0    Tom   20        12
1   nick   21        45
2  krish   19        32
3   jack   18        45

In [9]:
dataFrame['birthday'].astype(int)

0    12
1    45
2    32
3    45
Name: birthday, dtype: int32

In [10]:
dataFrame.describe()

             Age   birthday
count   4.000000   4.000000
mean   19.500000  33.500000
std     1.290994  15.588457
min    18.000000  12.000000
25%    18.750000  27.000000
50%    19.500000  38.500000
75%    20.250000  45.000000
max    21.000000  45.000000

# Slicing data from table in a specific location

In [11]:
dataFrame.loc[[0, 2, 3],['Name']]

    Name
0    Tom
2  krish
3   jack

In [12]:
dataFrame[['Name', 'birthday']]

    Name  birthday
0    Tom        12
1   nick        45
2  krish        32
3   jack        45

In [13]:
dict3 = {'Name':['Shadman'], 'Age':[21]}
df_N = pd.DataFrame(dict3)
df_N

      Name  Age
0  Shadman   21

In [14]:
# dataFrame.append(df_N)
# dataFrame

In [15]:
dataFrame.describe()

             Age   birthday
count   4.000000   4.000000
mean   19.500000  33.500000
std     1.290994  15.588457
min    18.000000  12.000000
25%    18.750000  27.000000
50%    19.500000  38.500000
75%    20.250000  45.000000
max    21.000000  45.000000

# drop perticular row

In [16]:
dataFrame = dataFrame.drop([0], axis=0)
dataFrame

    Name  Age  birthday
1   nick   21        45
2  krish   19        32
3   jack   18        45

In [17]:
import pandas as pd
dict4 = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}
df = pd.DataFrame(dict4)
df.head()

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [18]:
df['birthday'] = [12, 45, 32, 45]
df

    Name  Age  birthday
0    Tom   20        12
1   nick   21        45
2  krish   19        32
3   jack   18        45

In [19]:
df['marks'] = [92, 56, 30, 40]
df

    Name  Age  birthday  marks
0    Tom   20        12     92
1   nick   21        45     56
2  krish   19        32     30
3   jack   18        45     40

# droping whole column

In [20]:
df = df.drop(['Age'], axis=1)
df

    Name  birthday  marks
0    Tom        12     92
1   nick        45     56
2  krish        32     30
3   jack        45     40

In [21]:
df.iloc[1, 2]

56

In [22]:
df

    Name  birthday  marks
0    Tom        12     92
1   nick        45     56
2  krish        32     30
3   jack        45     40

# Replacing a value

In [23]:
df['marks'] = df['marks'].replace(56, 80)
df

    Name  birthday  marks
0    Tom        12     92
1   nick        45     80
2  krish        32     30
3   jack        45     40

In [24]:
for i in df.values:
    if i[1] == 45:
        print(i)

['nick' 45 80]
['jack' 45 40]

# importing data to csv

In [25]:
df.to_csv('demo.csv')

# reading data from csv

In [26]:
df_read = pd.read_csv('demo.csv')

In [27]:
df_read

   Unnamed: 0   Name  birthday  marks
0           0    Tom        12     92
1           1   nick        45     80
2           2  krish        32     30
3           3   jack        45     40

In [28]:
# df_read = df_read.drop(['Unnamed: 0'], axis=1)
# df_read.head()

In [29]:
df_Transpose = df_read.T
df_Transpose

              0     1      2     3
Unnamed: 0    0     1      2     3
Name        Tom  nick  krish  jack
birthday     12    45     32    45
marks        92    80     30    40

# merge two dataframes

In [30]:
import pandas as pd

df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value': [1, 2, 3, 4]})

df2 = pd.DataFrame({'key': ['B', 'D', 'E', 'F'],
                    'value': [5, 6, 7, 8]})

df1

  key  value
0   A      1
1   B      2
2   C      3
3   D      4

In [31]:
df2

  key  value
0   B      5
1   D      6
2   E      7
3   F      8

In [32]:
df1 + df2

  key  value
0  AB      6
1  BD      8
2  CE     10
3  DF     12

In [33]:
merge_df = pd.merge(df1, df2, on = 'key', how = 'outer')
merge_df

  key  value_x  value_y
0   A      1.0      NaN
1   B      2.0      5.0
2   C      3.0      NaN
3   D      4.0      6.0
4   E      NaN      7.0
5   F      NaN      8.0

In [34]:
merge_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   key      6 non-null      object
 1   value_x  4 non-null      float64
 2   value_y  4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes

In [35]:
merge_df = pd.merge(df1, df2, on = 'key', how = 'right')
merge_df

  key  value_x  value_y
0   B      2.0        5
1   D      4.0        6
2   E      NaN        7
3   F      NaN        8

In [37]:
df2

  key  value
0   B      5
1   D      6
2   E      7
3   F      8

# joint to dataframe

In [ ]:
# outerJoint_df = df1.